import React from "react";
import pres from "../../image/pres.png";
import "../PRESIDENT/President.css"
import Contact from "../contact/Contact";


function President(){
    return(
        <>
        <h1 className="head text-4xl p-4 bg-[#000268] text-white">Directorial Message</h1>
         <div className="President flex justify-around items-center bg-[#000268] p-6 py-9 text-white">
            <div className="us ">
                <p className=" ">"في كل بداية تكمن فرصة لتحقيق النجاح وتغيير العالم. بدأك في إنشاء شركة كورسات البرمجة يعكس شغفك وإيمانك بقوة البرمجة وتأثيرها الإيجابي على المجتمع. قرارك بمشاركة معرفتك ومهاراتك مع الآخرين هو خطوة رائعة وجريئة تستحق التقدير.

                    في رحلتك الجديدة، ستواجه تحديات وصعوبات، ولكن لا تنس أن النجاح يتطلب الصبر والتفاني. استخدم كل تجربة وكل تحدي كفرصة للتعلم والنمو. لا تخف من الفشل، بل استفد منه واستخدمه كمحفز لتحقيق المزيد.

                    تذكر أنك تقدم للآخرين فرصة لاكتساب المعرفة وتطوير مهاراتهم في مجال البرمجة. قد تكون الشركة التي أسستها هي البوابة التي تفتح للآخرين آفاقًا جديدة وتمكّنهم من تحقيق أحلامهم وأهدافهم.

                    لا تنس أنك تعمل في مجال متطور ومتغير باستمرار. استمر في متابعة أحدث التقنيات والاتجاهات في مجال البرمجة وتكنولوجيا المعلومات. ستكون تلك الرؤية المستقبلية هي سر نجاحك وتميز شركتك في سوق الكورسات.

                    أخيرًا، لا تفقد الشغف الذي دفعك إلى بدء هذه الرحلة. الشغف هو مصدر الطاقة والإلهام الذي سيبقيك ثابتًا في وجه التحديات ويساعدك على تحقيق رؤيتك. ابق متحمسًا وملهمًا وثق بقدرتك على تغيير العالم من خلال تعليم البرمجة.

                    مع كل خطوة تخطوها وكل درس تقدمه، ستقوم شركتك بتمكين المزيد من الأفراد وتجعلهم أكثر قدرة على تحقيق أهدافهم وتحقيق نجاحهم الشخصي. استعد لرحلة رائعة واستعد لتحقيق النجاح الذي تستحقه!"
                </p>
            </div>
            <div className="image bg-gradient-to-r from-cyan-500 to-[#3b82f652]">
                <img src={pres} alt="" className="  " />
            </div>
         </div>
         <Contact/>
        </>
    )
}
export default President;