import React from "react";
import logo from "../../image/codetrek.png";
import "../About/About.css"
import Courses from "../Cours/Courses";


function About(){
    return(
        <>
        <h1 className="head text-4xl p-4  text-white">About US</h1>
         <div className="about flex justify-around items-center bg-[#181950] p-6 py-9 text-white">
            <div className="image">
                <img src={logo} alt="" className="  " />
            </div>
            <div className="us ">
                <p className=" ">تأسست شركه (code trek) لكورسات البرمجه لمواكبة الطلب المتزايد على إنشاء المواقع الإلكترونيه و تطبيقات الجوال و إنشاء و إدارة حملات التسويق الرقمي . و تضم الشركه فريق عمل كامل به محترفين من كل التخصصات اللازمه لتنفيذ مواقع و تطبيقات للأنشطه التجاريه و الخدميه بمختلف مجالات عملها . سواء كنت مبتدئًا تبدأ الرحلة البرمجية الأولى أو مطوّرًا متقدمًا يسعى لتعلم تقنيات جديدة، فإن لدينا الدورات المناسبة لاحتياجاتك.
تتميز دوراتنا بأنها مبنية على منهجية تعليمية متكاملة، حيث يتم تقديم المفاهيم النظرية بشكل واضح ومنطقي، مع التركيز على التطبيق العملي وحل المشكلات العملية. نحن نؤمن بأهمية التفاعل والمشاركة الفعالة في عملية التعلم، ولذا نقدم تمارين ومشاريع عملية تساعدك على تطبيق المفاهيم التي تعلمتها وتعزيز فهمك ومهاراتك العملية .
بالإضافة إلى الدروس التعليمية، نوفر موارد إضافية مثل مقالات ومدونات ومنتديات المجتمع لتوفير بيئة تفاعلية للمتعلمين. يمكنك أيضًا الوصول إلى دوراتنا عبر الإنترنت في أي وقت ومن أي مكان يناسبك.</p>
            </div>
         </div>
         <Courses/>
        </>
    )
}
export default About;